{
  "onboarding": {
    "notifications": {
      "action": "Autoriser les notifications",
      "intro": "Restez informé des dernières mises à jour, actualités et informations importantes.",
      "description": "Nous nous engageons à ne vous envoyer que des notifications utiles et significatives.",
      "notes": "Vous avez la possibilité de modifier vos préférences de notification à tout moment dans les paramètres de votre appareil.",
      "title": "Notifications",
      "granted": {
        "intro": "Vous avez activé les notifications.",
        "description": "Vous recevrez désormais des mises à jour et des notifications de notre part.",
        "notes": "Vous pouvez modifier ce paramètre dans les réglages de votre appareil."
      },
      "denied": {
        "intro": "Vous avez désactivé les notifications.",
        "description": "Pas de problème! Nous veillerons à ne pas perturber votre tranquillité.",
        "notes": "Vous pouvez toujours activer les notifications dans les paramètres de votre appareil."
      }
    },
    "personalized_ads": {
      "action": "Activer les publicités personnalisées",
      "intro": "En autorisant les publicités personnalisées, vous bénéficierez d'une expérience publicitaire adaptée à vos intérêts.",
      "description": "Nous respectons votre vie privée et nous nous engageons à utiliser vos informations uniquement dans le but d'améliorer votre expérience et de présenter des publicités pertinentes.",
      "title": "Publicités personnalisées",
      "denied": {
        "intro": "Vous avez désactivé les publicités personnalisées.",
        "description": "Nous respectons votre choix. Vous verrez des publicités génériques à la place.",
        "notes": "Vous pouvez modifier ce paramètre dans les réglages de votre appareil."
      },
      "granted": {
        "intro": "Vous avez activé les publicités personnalisées.",
        "description": "Vous verrez des publicités adaptées à vos intérêts.",
        "notes": "Vous pouvez toujours activer le suivi dans les paramètres de votre appareil."
      }
    },
    "restore_premium": {
      "action": "Restaurer les achats",
      "intro": "Si vous avez précédemment acquis la version premium, nous vous recommandons de restaurer vos achats pour retrouver l'accès à toutes vos fonctionnalités premium.",
      "notes": "Veuillez noter que vous avez la possibilité de restaurer vos achats à tout moment.",
      "title": "Restaurer les fonctionnalités premium"
    },
    "user_currency": {
      "action": "Choisissez votre devise",
      "intro": "Sélectionnez votre devise préférée pour afficher les prix dans votre devise locale.",
      "notes": "Veuillez noter que vous avez la possibilité de changer de devise à tout moment dans les paramètres.",
      "title": "Devise"
    },
    "welcome_finance_traders": {
      "intro": "Optimisez votre stratégie de trading à l'aide de nos outils sophistiqués de gestion des risques pour des résultats optimaux.",
      "description": "Prenez le contrôle et tradez en toute sérénité.",
      "title": "Bienvenue, Traders"
    }
  }
}
